a
aahara
aam
aamavata
aamvata
aavarana
abdomen
abdominal
abhayanga
abhighata
abhyanga
abhyantar
abhyantarpana
abnormal
abnormalities
abortifacient
abortion
about
above
absence
absolute
absorbance
absorbed
absorption
abstruse
abundant
acanthosis
acceptable
acceptance
accepted
accidents
accompanied
accordance
according
account
accounting
accounts
accumulate
accumulated
accumulation
ace
acetate
achara
acharya
acharyacharak
acharyas
aches
achieve
acia
acid
acquire
across
act
acting
action
actions
active
activities
activity
acts
acupressure
acute
added
addicted
addition
adequate
adharaniya
adharaniyavegas
adhatoda
adhyaya
adipose
administered
administrable
administration
admitted
adopted
adopting
adscendens
adult
adulteration
adulthood
adults
advance
advances
adverse
advice
advised
advocates
aegle
aerosol
aetiology
affect
affected
affecting
affects
affinity
affliction
africa
after
agada
agadatantra
agadaveda
again
against
agar
age
aged
ageing
ageingand
agents
aggravated
agni
agnikarma
agnimandya
ago
ahara
ailment
ailments
aim
aimed
aims
air
airways
ait
akalaja
alarka
alarming
alasya
albino
alcohol
aleurone
alkaline
alkaloid
alkaloids
all
allergens
allergic
allergological
alleviate
alleviating
allopathic
almost
along
alpa
alpha
also
alter
altered
alternative
although
altitude
aluminum
always
am
ama
amalaki
amapachana
amavata
amazing
ambu
amcginely
ameliorating
amlapitta
among
amongst
amount
ampicillin
amputation
amrita
amritaadi
amritadya
an
anacardium
anaemia
anaesthesia
analgesic
analgesics
analogous
analyse
analysed
analyses
analysis
analytical
analyze
analyzed
analyzing
anatomical
anavasthita
ancient
ancients
and
android
anemia
anga
animal
animals
anisocytic
ankylosing
annular
ano
anomocytic
anorexia
another
anovulatory
antenatal
anterior
anthelmintic
anti
antiasthmatic
antiasthmatics
antibacterial
antibiotics
antidepressant
antidiabetic
antihelmentic
antiimplantation
antimicrobial
antioxidant
antioxidants
antiplatelet
antipyretic
antiseptic
antispasmodic
antitumor
anupana
anurasa
anxiety
any
anya
anyonya
anywhere
apamarga
apana
apart
apasmara
apathya
aphrodisiac
apnea
appearance
appears
appetite
applicable
application
applications
applied
applying
approach
approaches
appropriate
approval
approximate
approximately
apunarbhava
aqua
aqueous
aragvadha
aragwadadi
arbuda
ardita
are
area
areas
arishta
arka
arkadi
arn
arogyakalpadruma
arohanayasa
around
arranged
arrangements
array
arsha
artery
arthritis
article
articles
aruchi
aruna
as
asaatmya
asanadi
ascaris
ascertain
aschyotana
asclepiadaceae
asd
aseptic
ash
ashaya
ashraya
ashrayi
ashrita
ashtanga
ashwagandha
ashwasana
asia
asked
asparagus
aspect
aspects
aspiration
aspirin
asrigdara
assam
assay
assess
assessed
assessing
assessment
assessments
assimilation
assist
associated
asta
astanga
asthi
asthma
asthmatic
asthmatics
astreptococcus
astringent
at
atec
atherosclerosis
atisara
attains
attempt
attempted
attempts
attending
attention
attracts
attributed
attributes
atura
augmenting
ausadha
authentication
authentification
authors
autism
autoimmune
autointoxication
available
avaleha
avarana
avarthana
avartita
average
awareness
away
ayurved
ayurveda
ayurvedic
baby
back
backache
backward
bacopa
bacteria
bacterial
baker
bakuchi
bala
balaashwagandha
balance
balances
balancing
balatisara
bandage
banks
bariatric
bark
barrier
barriers
base
based
basic
basically
basis
basti
batch
batches
bath
bbb
be
bearer
bearing
bears
because
become
becomes
bed
been
before
begin
begins
behavior
behavioral
behaviour
behind
being
beings
believed
belonging
belongs
beneficial
benefited
benefits
bengal
benign
best
beta
better
between
bhagandara
bhagna
bhaishajya
bhaishajyakalpana
bhallataka
bharaharana
bhasma
bhastrika
bhavana
bhavprakash
bhavprakasha
bhintgilodi
bhrama
bhumithalam
bigger
bija
bijapura
billion
bilwa
bimolecular
bioactive
biochemical
biologic
biological
birth
biseriate
bite
bitter
bleeding
blind
blindness
blockers
blood
bloodletting
bloody
bodied
bodily
body
boerhavia
bone
books
border
born
botanical
botanically
both
bottle
bound
bout
bowel
bph
brahmi
brahmisohaladi
brain
branched
break
breaks
breast
breath
breathing
brief
brihat
brihattrayi
bring
broad
bronchial
bronchitis
bruhatrayi
brushing
bulky
bundle
burn
burning
but
by
calcium
calculated
calculation
calculations
calibration
called
calotropis
came
can
cancer
cancers
candanaadi
candida
candies
candy
capable
capsule
carak
caraka
carbohydrates
cardiac
cardinal
cardiovascular
care
caries
carried
carry
carryout
cars
case
cases
categories
categorized
category
causative
cause
caused
causes
causing
causitive
cavities
cavity
cbc
celastrus
cell
cells
central
centre
centuries
century
cerebrovascular
certain
certainly
certified
chakradutta
challenge
challenged
challenging
chances
chandra
chandrakala
change
changed
changes
channel
channels
chanting
chapter
character
characteristic
characteristics
characterized
characters
charaka
charantia
chebula
checklist
chemical
chemicals
chhattisgarh
chief
chiefly
chikitsa
child
childhood
children
chin
chinese
chiruvilwa
chitraka
chitrakadi
chittatva
chloramphenicol
choisy
choornakizhi
choornavasthi
chosen
chromatographic
chromatographically
chromatography
chronic
chronicity
churna
churnas
chyme
cicatrix
cikitsa
cinnabar
ciprofloxacin
cirabilwa
circulation
circulatory
cited
citrus
civilization
claimed
claims
classical
classically
classics
classification
classified
cleaning
cleansing
clear
clearing
clearly
climber
clincal
clinical
clinically
clinico
close
closure
clue
cluster
cml
cns
coarse
cognitive
coin
cold
coli
colic
colitis
collect
collected
collection
college
colon
color
colored
colour
colours
combination
combinations
combined
comes
coming
commentators
commercial
committee
common
commonest
commonly
communication
communities
community
comparative
comparatively
compare
compared
comparison
compilation
compile
compiled
complaint
complaints
complete
completely
completion
complex
compliance
complicated
complication
complications
complying
component
components
composed
composition
compound
comprehend
comprehensive
compressed
comprising
conceive
conceived
concentration
concentrations
concept
conceptual
concerned
conch
conclude
concluded
conclusion
condition
conditions
conducted
confirmed
confirming
confirms
congenial
congestive
congruence
connected
considerable
considerably
consideration
considerations
considered
considering
considers
consist
consistency
constant
constantly
constipation
constituent
constituents
constitution
constricted
consult
consultation
consume
consumed
consumption
contact
contained
containing
contains
contemplative
contemporary
content
contents
context
continue
continuity
continuous
contraction
contrary
contribute
contributing
contributory
control
controlled
controlling
controls
controversy
conventional
converted
convolvulaceae
copd
copper
core
cork
cornea
corneal
coronary
correct
correcting
correction
correlate
correlated
correlation
corresponds
cortex
corticosteroid
corylifolia
cosmeceuticals
cosmetic
cost
cough
could
council
count
counterpart
countries
course
coverage
cow
create
created
creates
creatinine
criteria
critical
critically
cross
crossing
crude
crystal
crystals
cumcumayana
cup
curable
curative
curcumin
cure
cured
curing
curiosity
curna
current
currently
cut
cutting
cycle
cycles
cyst
cystic
cysts
cytotoxic
daha
daily
daivavyapashraya
daivavyapashrayya
damage
damages
daruharidra
dasamoola
data
datas
date
daurbalya
day
days
dealing
deals
death
deaths
debilitating
debility
decade
decades
decide
decided
deciduous
declared
decline
decoction
decomposition
decrease
decreased
dedicated
defects
defence
deficiency
define
defined
delaying
delicate
delinates
delineated
delivered
delivery
demand
demonstrated
denoted
dental
department
dependent
depending
depends
depleted
depresses
depression
dept
depth
derangement
dermatitis
described
describedunder
describes
description
descriptions
design
designated
designed
desired
despite
dessicate
detail
detailed
details
deterioration
determinant
determination
determinations
determine
determined
determines
determining
develop
developed
developing
development
develops
deviation
dhamani
dhamanis
dhanyaka
dhanyamala
dhanyamla
dhara
dharaniya
dhatri
dhatu
dhatukshayaja
dhatus
dhayni
dhoopana
dhumapana
dhupa
diabetes
diabetic
diabetics
diagnosed
diagnosis
diagnostic
diajith
diarrhea
diarrheal
diarrhoea
did
diet
dietary
dietetics
differ
difference
differences
different
differentiated
difficult
difficulties
difficulty
diffusa
diffusion
digestible
digestion
digestive
dilution
diminish
dinacharyas
dincharya
dipaniya
direct
directly
disability
discharge
discharging
discomforts
discontinued
discriminated
discriminative
discuss
discussed
disease
diseased
diseases
disintegration
disorder
disorders
dissimilar
distance
distinct
distinctive
distributed
disturbed
disturbing
divergent
divesting
divided
divine
do
documentation
does
doherty
dominance
dominant
done
dorgandhya
dosage
dose
doses
dosha
doshaja
doshajanya
doshas
doshic
doshika
double
doubts
douche
dourbalya
down
downwards
dpn
drain
drakshadi
dramatic
dravya
dravyaguna
dravyas
drawback
dried
dries
drops
drug
drugless
drugs
dry
drying
dsm
due
dugdha
duration
during
durvadi
dushya
dusts
dusya
dwitiya
dysentery
dyslipidaemia
dyslipidaemic
dysmenorrhea
dysmenorrhoea
dyspareunia
dyspepsia
dyspnoea
each
early
easily
easy
ecg
eclampsia
ecological
economical
eczema
edge
edition
educated
effecacy
effect
effecting
effective
effectively
effectiveness
effects
efficacies
efficacy
effort
efforts
eight
eighty
either
ekayam
elderly
electric
elemental
elements
eliminates
eliminating
elongated
elucidate
emaciated
emblica
emerging
emf
emotional
emphasize
emphasized
emphasizes
emphysema
empirical
empirically
empty
encapsulated
encompass
encompasses
encouraging
end
endangered
endeavor
ending
endocrine
endodermal
enema
enhance
enlarged
enlargement
enlists
enormous
enough
ensued
ensure
ensured
ensuring
entamoeba
enteric
enters
entire
entity
environment
environmental
enzyme
epidemic
epidemiological
epidermal
epidermis
epilepsy
episodes
epithelial
epithelialization
epithelization
equal
equally
equations
equipped
equivalents
era
eranda
erandaharitaki
erandashunti
erosions
erratic
erythropoietic
escherichia
especially
esr
essence
essential
essentially
establish
established
establishes
establishing
establishment
ester
estimate
estimated
estimates
estimation
estimations
etc
ethanolic
ether
ethical
ethnobotany
ethnomedicinal
ethyl
etiological
euthyroidism
evaluate
evaluated
evaluation
even
events
ever
every
everyday
everyone
evidence
evident
evolved
examination
examinations
examined
excellence
excellent
excess
excessive
excision
excluded
exclusively
exercise
exertion
exhibited
exhibits
expectancy
expected
expectorant
expectoration
expel
expenditure
experience
experienced
experiences
experiment
experimental
experiments
expert
explain
explained
explains
explanation
explanations
explore
explored
explores
exposable
exposure
extent
external
extract
extractive
extracts
extraordinary
extremities
eye
fabaceae
face
faces
facilitate
fact
factor
factors
fail
failure
family
fan
fast
fat
fatigue
favor
feature
features
feeding
feet
felt
female
fever
few
fibers
fibres
fibroid
fibroids
field
fifteen
fight
final
finally
find
findings
finger
fingerprints
fire
first
fistula
fistulous
fix
fixed
flap
flattened
flatulence
flavonoids
floated
flora
floral
floras
flourescence
flow
flower
focus
focuses
foliate
folk
folklore
folks
follicles
follow
followed
following
food
foods
footwear
for
force
forearms
foremost
form
format
formation
forms
formulating
formulation
formulations
fornices
forty
foul
found
four
fractures
free
freely
frequency
frequent
frequently
fresh
freshly
friability
friendly
from
fruit
fruits
fulfilling
full
fulvic
fumigating
function
functional
fundamental
furnace
further
future
gaertn
gain
gajaturanrathapadaticharya
gana
ganas
gandamala
gandarahastha
gandarvahasthadi
gandharvahasthadi
gap
garbhini
garbhodak
gastro
gastrointestinal
gathered
gaurava
gel
general
generally
generated
generation
generations
genital
gently
genuine
genuineness
gestation
get
gets
getting
ghana
ghanavati
ghataka
ghee
ghrita
ghritam
giddiness
gigantea
git
give
given
gives
giving
global
globally
globules
glorifying
gloriosa
glucose
glycosides
goal
godudgha
going
gokshura
gold
good
gossypium
got
gout
government
govt
grade
graded
graduate
graha
grahani
grain
grains
gram
granthas
granthi
graph
gravimetric
gravity
great
greater
greatest
greeva
grey
gridhrasi
grille
grounds
group
groups
grow
growing
grown
grows
growth
grudhrasi
guda
guduchi
guggulu
guideline
guidelines
guides
gujarat
guna
gunas
gut
guwahati
gynaecological
gynecological
habitat
habits
habituated
had
haemoglobin
haemopoetic
haemorrhoids
hair
hairs
half
hardness
harita
haritaki
harmful
harmony
harry
harsha
has
hasten
hatanala
have
having
hazardous
he
head
headache
heal
healing
health
healthy
hearing
heart
heavily
heavy
hectic
helminthiasis
help
helped
helpful
helping
helps
hence
hepatoprotective
her
herb
herbaceum
herbal
herbs
here
herself
hesitation
hetu
hexagonal
heymann
heyneanus
hgs
hiccough
high
higher
highlight
highlighting
highlights
highly
hikka
hildegarde
him
hindu
hingusauvarchaladi
hip
hirsute
his
histaminic
histochemical
history
homeostasis
honey
hook
hoped
horizons
hormonal
hospital
host
hour
how
however
hptlc
hridaya
hrs
human
humic
humification
humified
humoral
hunger
husband
hutaswa
hygiene
hyoscyamus
hyper
hyperactivity
hyperplasia
hypertension
hypertention
hypocrateriformis
hypoglycaemic
hypoglycemic
hypometabolism
hypotensive
hypothermia
hypothyroid
hypothyroidism
hystolytica
ideal
identification
identified
identities
idiopathic
if
ill
illness
imbalance
imbalances
immediately
immemorial
immense
immensely
imminent
immune
immunity
immunodeficiency
immunomodulatory
immunostimulant
impact
impacting
impaired
impairment
implemented
implies
importance
important
improper
improperly
improved
improvement
improvements
improves
improving
in
inbreed
incidence
incinerated
include
included
includes
including
inclusion
incomplete
inconveniencies
increase
increased
increases
increasing
increasingly
increment
index
india
indian
indians
indicate
indicated
indicates
indicating
indications
indigenous
indirectly
individual
individually
individuals
induration
industrialized
industries
infantile
infants
infection
infections
infectious
infective
infertility
infiltration
infirmity
inflammation
inflammatory
information
informations
infrared
ingredient
ingredients
inhalation
inhibit
inhibition
inhibitors
inimitable
initial
initiation
innate
inner
inside
insignificant
insoluble
insomnia
instead
institute
institutes
institutional
institutions
insulin
intake
integral
integration
intelligence
intense
intensity
intention
inter
interaction
intercourse
interest
interesting
interests
interferes
internal
internally
international
internationally
internet
interpretation
intervals
intervention
intestinal
intestine
intestines
into
intravenously
inula
invasive
investigate
investigated
investigation
investigations
involucrata
involve
involved
involvement
involves
involving
iodine
ipd
ipgt
iron
irregular
irritation
is
isolation
issues
it
itching
itchy
items
its
itself
jaal
jaipur
jalaukaavacharna
jalaukavacharana
jamc
jamnagar
janch
jara
jarana
jata
jatamamsi
jatharagni
jati
jethimala
jharkhand
joints
journals
just
justifies
jvara
jwara
jyotishmati
kakamachi
kala
kalaja
kalaor
kalpa
kalpana
kalpanas
kamala
kampillaka
kandu
kanoti
kantakari
kapha
kaphaja
kaphamedohara
kapota
karela
karma
karmabasti
karnataka
karpasa
karveera
kasa
kasaya
kashaya
kashtartava
kashya
kati
katu
katuki
kaumarabhrithya
kayachikitsa
keeping
keeps
kept
kerala
key
khadira
khadiradi
khara
kidney
killer
killers
kind
kinds
kitibha
kizhi
know
knowledge
known
kollankola
koshna
koshtha
kostha
krichrasadhya
krimighna
kriya
kriyas
kshar
kshara
ksharasuta
ksharasutra
ksharsutra
kshaya
ksheerbala
ksheerdhooma
kshetra
kshudha
kshudra
kurudu
kurudukola
kushta
kushtha
kutaja
kvatha
kwath
kwatha
kwaths
laboratory
laced
lack
lacking
lactation
lady
laghu
laid
laksha
lakshana
langali
lanka
lankan
large
largely
larger
last
lasting
latent
later
laterally
lavana
lawless
laxative
layer
laziness
lead
leading
leads
leaf
leaflets
leafy
learned
leaves
led
leg
legs
lekhana
length
lepa
lepas
leprosy
leptin
less
lesser
lethargy
leucoderma
leucorrheoa
leucorrhoea
leukemia
leukemic
level
levels
levigation
lexicons
lice
licorice
lie
lies
life
lifestyle
lifestyles
lifting
lignin
like
likely
liliaceae
limb
limbs
limit
limitations
limited
limits
linaria
line
link
linked
linn
lipid
lipopolysaccharides
liquid
literally
literary
literature
literatures
little
lives
living
loaded
local
localized
located
locomotor
logic
long
longer
longevity
longum
look
loss
lot
low
lowback
lower
lowering
lozenges
luke
lumbricoids
lumen
lung
lungs
luti
lymphoblastic
lymphomas
lysigenous
machine
macroscopic
macroscopically
madava
made
madhavakara
madhumeh
madhumeha
madhumehajanya
madhya
magazines
magnitude
mahakashaya
maharashtra
maharoga
main
mainly
maintain
maintained
maintaining
maintenance
majja
majjabasti
major
majority
make
making
malaise
malaria
malarial
malarupa
malas
male
males
malnutrition
malvaceae
mamsopachaya
mamsyadi
man
manage
managed
management
managing
mandagni
manifest
manifestation
manifested
manovaha
manshila
manso
mantra
manufacturers
manufacturing
many
marana
maricha
maricham
marine
marital
marked
markedly
marker
market
marma
marmelos
married
marrow
marsdenia
mass
massage
masses
matches
materia
material
materialistic
materials
maternal
mathematical
mathematics
matra
matrabasti
matrix
maximize
maximum
may
mean
meaning
means
measles
measure
measured
measurement
measures
mechanisms
meda
medas
media
median
medica
medical
medically
medicament
medicaments
medicated
medication
medications
medicinal
medicinally
medicine
medicines
medium
medohara
medoroga
medovaha
medullary
meet
megaloblastic
mellitus
membrane
membranes
men
menopause
menstrual
menstruation
mental
mentally
mentioned
mentions
mercurial
mercury
mere
message
metabolic
metabolism
metabolites
metabolized
metallic
methanol
methanolic
method
methodologies
methods
mgach
mice
michal
micro
microbial
microcirculatory
micrometric
microscopic
microscopical
microscopy
microvascular
mid
miers
might
mild
milk
million
millions
mimics
min
mind
mineral
minerals
minimal
minimising
minimized
minimizes
minimum
minor
misdiagnosed
mitigated
mobility
modaka
modalities
modality
mode
model
models
moderate
modern
modes
modification
modifying
module
molecules
momordica
monnieri
month
months
mooladi
morbid
morbidly
more
moreover
morning
morphological
morphology
mortality
most
mother
motivates
movements
moving
mrityu
much
mucosa
mucus
mudpack
muffle
mukh
mukta
mula
multifarious
multiple
multiseriate
muscle
muscles
muscular
musculoskeletal
must
mutrakrichchra
mutravaha
mutualism
myalgia
myeloid
mysore
naalchedan
nadu
naga
nagpur
nakha
namaskaras
name
namely
nanatmaja
nanjangud
nape
narrated
nasal
nasya
natal
nation
national
nations
native
natural
naturally
nature
naturopathy
nausea
navana
navel
navjata
nayana
near
nearly
necessary
necessitate
necessity
neck
need
needed
needs
neem
nees
negative
negligible
neither
neonatal
neonate
neoplastic
nepal
nerve
nervous
nested
neurodevelopmental
neuropathy
new
next
nicotiana
nidaana
nidana
nidanas
nidra
niger
nighantus
night
nigricans
nigrum
nil
nimba
nimbidin
nine
niruttha
no
nomenclature
non
none
nor
norfloxacin
normal
normalize
normally
not
note
noted
noticed
nourishment
novel
now
nowadays
nsaid
number
numbers
numbness
numerous
nummularia
nutrients
nutrition
nutritional
obese
obesity
objective
objectives
obliquely
observable
observation
observational
observations
observe
observed
obstacles
obstruction
obstructive
obtain
obtained
obviously
occupation
occupational
occur
occurred
occurrence
occurring
occurs
ocimum
odisha
odor
of
offers
official
officinalis
offspring
often
oil
ojas
ojovaha
ojus
old
oleation
on
once
one
only
onset
oozing
opd
open
operation
operculina
optimum
option
options
or
oral
orally
order
organ
organism
organisms
organized
organoleptic
organoleptically
organs
origin
original
originated
orlistat
osteoarthritis
other
others
our
out
outcome
outlook
outpatient
ovarian
ovaries
ovary
over
overall
overcome
overweight
overwork
ovoid
ovulation
ovum
owing
oxalate
oxidant
paaduka
pachana
pachaniya
pacification
pacify
pad
paid
pain
painful
paired
palatable
pana
panchakarma
panchakola
panchkarma
panchvalkal
panckarma
pancolitis
pandu
panduta
paniculata
paper
paracytic
parameter
parameters
paranchymatous
parasika
parasite
parasurgical
paricharya
parijata
pariksha
parimarjana
parinama
parinamashula
parna
parpati
part
participants
particular
particularly
parts
pashanabhedadi
passage
passive
past
paste
patch
patches
pathogenesis
pathogenic
pathogens
pathological
pathologies
pathology
pathophysiology
pathway
pathya
pathyakalpana
patient
patients
patra
patrapinda
pattern
pattu
pattus
pay
pcos
peak
pearl
peculiar
peculiarity
pediatric
pef
pefrate
people
peptic
per
perceived
perceiving
percent
percentage
perception
perfect
perform
performed
performing
pericarp
pericyclic
period
peripheral
permeability
permeable
permissible
peroxide
persistence
persistent
persists
person
personalized
perspective
pertaining
petaloidea
petroleum
phala
phang
phanji
phanta
pharmaceutical
pharmaceuticals
pharmacodynamic
pharmacognostic
pharmacognostical
pharmacognostically
pharmacological
pharmacology
pharmacopoeia
pharmacopoeial
phase
phenolic
phenols
phenomenon
phloem
phosphorus
physical
physically
physician
physicians
physico
physicochemical
physiochemical
physiological
phyto
phytochemical
phytochemically
phytogroups
picture
pigmentor
pills
pilonidal
pinpointing
pipalli
pipasa
piper
pippali
pippalimula
pitha
pitta
pittaja
pittajatisara
pittapradhana
pitted
place
placebo
placement
places
plan
planned
planning
plant
plants
plasmodium
plasticity
platelet
plates
play
plays
plenty
plethora
pogostemon
point
poison
poisonous
pollution
poly
polycystic
polyherbal
polyneuropathy
popular
popularity
population
populations
positive
possess
possesses
possessing
possible
post
posterior
postnatal
posttest
potency
potent
potential
potentially
potentials
potentiates
poultice
powder
power
prachhanna
practical
practically
practice
practiced
practices
practitioners
pradahanashaka
pradesh
pradhana
pradhanavyadhi
prakopa
prakrita
prakriti
prakritisthapana
prameha
prana
pranavaha
pranayama
pranayamas
prasadana
prashamana
pratyagamana
pratyanga
pravala
prayer
pre
precipitating
predicted
predominance
predominant
preferred
pregnancy
pregnant
preliminary
premature
preparation
preparations
prepare
prepared
preparing
prescribed
prescribes
presence
present
presentation
presented
presents
pressure
prevalence
prevalent
prevent
preventable
prevented
preventing
prevention
preventive
prevents
previous
primarily
primary
prime
principal
principle
principles
print
prismatic
prista
probable
problem
problems
procedural
procedure
procedures
procera
process
processed
processes
processing
produce
produced
produces
producing
product
productive
products
professional
profile
profiling
profound
prognosis
progressive
projected
proliferation
prominent
promising
promote
promoted
promotes
promoting
promotion
prone
propensity
proper
properly
properties
property
proportion
proportions
proposed
propounds
prospective
prostate
prostatic
protection
protocol
prove
proved
proves
provide
provided
provides
prysmatic
psoralea
psoriasis
psoriatic
psycho
psychological
psychotic
pubescent
public
published
puerperium
pulmonary
punamava
punarnava
purchased
pure
purely
purification
purificatory
purity
purple
purpose
purposes
pursuing
pushyanuga
puta
qualitative
quality
quantitative
quantitatively
quantity
quickly
quite
quoted
quotes
race
racemosa
radially
radiates
raised
rajarka
rajasthan
rajayaksma
raksha
rakta
raktaashaya
raktadhatu
raktaja
raktamokshan
raktamokshana
raktavaha
raktpradoshajvikara
ramosissima
random
randomized
randomly
range
ranges
ranging
rapid
rapidly
rare
rarely
ras
rasa
rasadhatu
rasakalpa
rasakriya
rasam
rasanirdharna
rasapanchaka
rasapravicharana
rasaratna
rasaratnasamucchaya
rasashastra
rasasindhooram
rasasindura
rasavaha
rasavahini
rasayana
rasayanas
rash
rasnasapthakamkashayam
rate
rates
rather
rating
ratio
rationale
ratnavali
ratricharya
rats
raw
ray
rays
rbs
reach
reached
reaches
reaching
reaction
reactions
reader
readers
ready
realized
rear
reason
reasons
receive
received
receiving
recent
recently
recipe
recitation
reckoner
recognize
recognized
recommended
recommends
reconstructed
recorded
recovery
recruited
rectal
rectum
recurrence
recurrent
red
reduce
reduced
reduces
reducing
reduction
reference
references
referred
referring
refers
reflection
reflects
refractive
regarded
regarding
regardless
regards
regimen
regimes
region
registered
regular
regulating
regulation
rejuvenating
rejuvenation
rejuvenative
rekhapurnatva
related
relates
relating
relation
relations
relationship
relative
relaxation
relevance
relevant
relief
relieved
relieving
remain
remains
remarkable
remedial
remedies
remedy
remission
renal
repeated
repetitive
replacement
replacing
report
reported
reporting
reports
represent
represents
reproducibility
reproducible
reproductive
reputed
require
required
requiring
reschedules
research
researchers
researches
resembles
reservoirs
resistance
respect
respectively
respiratory
responded
respondents
response
responsible
rest
restoration
restore
restoring
restricted
result
resultant
resulted
resulting
results
resuscitation
retained
retz
reveal
revealed
revealing
reveals
reverse
review
reviewed
reviewing
reviews
revolutionary
rheumatic
rheumatism
rheumatoid
rhizome
rice
richest
right
rigid
ring
rise
rising
risk
rite
ritu
ritucharya
rivea
roga
rogaadhikaar
rogadhikara
rogamarga
rogas
rohitakmul
role
room
rooming
root
roots
ropana
rosette
rotations
route
routes
routine
routinely
ruksha
ruptured
s
saalasaradi
saatmya
sada
sadvrittapalan
sadwidyashala
safe
safely
safer
safety
sages
sahasrayogam
said
sakapha
salod
samana
samanya
same
samgraha
samhita
samhitas
sample
samples
sampling
samprapti
samsamana
samuchchaya
samvahana
sanctum
sand
sandhaneeya
sandhi
sandhigata
sannipatika
sanskrit
santarpanajanya
saponification
saponin
saponins
sapta
saptaparna
saptavartita
sara
sarvanga
satisfactory
satisfied
satisfying
satvavajaya
satwa
scale
scales
scalp
scaly
scattered
scenario
schlerides
scholars
schrad
science
scientific
scientifically
scientist
sclerenchyma
scleroids
scope
score
scorpion
scrape
screened
screening
scrophulariaceae
sea
search
seasonal
seat
second
secondary
secretions
section
sections
sedentary
seed
seeds
seeking
seen
selected
selection
selective
selectively
semecarpus
semen
semisolid
sensation
sensations
sense
sensorimotor
sensory
separate
septate
series
serious
serum
serve
serves
serving
set
seven
several
severe
severity
sex
sexes
sexual
shadushana
shakadravya
shamaka
shamana
shankha
shankhapushpi
shape
shaped
sharing
sharirardha
shatapushpa
shatapushpadya
shatyadi
she
sheeta
shelf
shelter
shiatsu
shilajatu
shilajith
shirodhara
shiroroga
shiroshoola
shishu
shivagutika
shleshma
shloka
shodana
shodhana
short
shorter
shortly
shortness
shosha
shotahara
shotha
should
show
showed
showing
shown
shows
shrama
shringataka
shrub
shukla
shukra
shunti
shvasa
shwasa
shwasaaghna
shwasaghna
shweatpradar
shweta
shwetapradar
shwetarka
shwetpradar
shwitra
shyama
shyness
sibutramine
siddha
side
sides
sigmoid
sign
signal
significance
significant
significantly
signifies
signs
silica
silky
silva
similar
similarity
simple
simultaneously
since
sincerely
single
sink
sinus
sinuses
sira
siras
siravedhana
sirolepa
situation
six
sixty
size
sized
skin
sleep
slighter
sloughing
slow
small
smaller
smear
smell
smoke
smoking
smp
snake
snakebite
snana
sneha
so
social
socially
society
sodhana
soft
soil
solanaceae
solanum
sold
solid
solubility
soluble
solution
solvents
some
someone
somnifera
sonography
soon
sores
source
sources
south
span
spandana
spasmodic
special
specially
specialty
species
specific
specifically
spectrophotometer
spectrophotometric
spectrophotophotometric
spectrum
speech
speed
sperm
sphatika
spite
spoken
spondilities
spondilitis
spots
spraying
spread
spreads
springer
sputum
srava
srbc
sri
srotas
ssanh
stabdhata
stable
stage
stages
standard
standardisation
standardization
standardize
standardized
standards
starch
starts
state
stated
states
statistical
statistically
status
steadily
stem
stems
step
steps
steroidal
sterols
sthana
sthanika
sthanyasodhana
sthapana
sthaulya
sthoulya
stiffness
still
stills
stimulating
stimulation
stomach
stomata
stone
stool
strain
strains
strategies
stratified
streams
streeroga
strength
strengthen
strengthening
streptococcal
stress
stressful
stretching
stri
striking
stroke
strongly
structure
structures
student
studied
studies
study
studying
stunted
style
styles
sub
subject
subjected
subjective
subjects
sublimated
subsequently
substance
substances
substitute
substitutes
subtotal
successful
successfully
such
suffer
suffered
suffering
sugar
suggest
suggested
suggesting
suggestive
sukshma
summery
sunken
sunthi
superba
superficial
superior
supplement
supplemented
supply
supported
suppositories
suppository
suppress
suppressed
suppressible
suppression
suppressive
suptata
surface
surge
surgeon
surgeons
surgery
surgical
surprisingly
survey
survive
surya
susceptible
sushruta
susruta
sustain
sutika
sutra
svarasa
sveda
svedana
swarna
swasa
swasahara
swashtha
sweda
swedana
sweet
swelling
swollen
symmetrically
symptom
symptomatically
symptomatology
symptoms
syndrome
synonym
synonymous
synthetic
syrup
system
systematic
systemic
systemically
systems
t
tab
tabacum
tablet
tableting
tablets
tagaradi
taila
tailaa
tailam
tailas
take
taken
takes
taking
takradhara
tamaka
tamakashwasa
tamalapatra
tamatva
tamil
tampons
tamra
tamraparna
tannin
tannins
tap
tara
target
targeted
targeting
tartam
taste
taverniera
tea
teaching
techniques
tejapatra
temperature
ten
tenacissima
tendency
tenderness
tension
tentative
term
terminalia
terminating
terms
test
tested
testing
tests
texs
text
textbooks
texts
than
that
the
their
them
themselves
then
therapeutic
therapeutics
therapies
therapy
there
thereby
therefore
thereupatic
these
thesecondary
they
thick
thin
things
third
thirst
thirty
thiruvananthapuram
this
thorough
those
though
thought
thousands
threading
threatening
three
threshold
through
throughout
thus
thyroid
tikshna
tikta
til
till
time
times
tingling
tiredness
tissue
tissues
titre
tlc
tnf
to
tobacco
today
toe
together
tone
tones
tongue
tonic
too
tooth
top
topic
torch
total
touches
touching
towards
toxic
toxicity
toxins
trace
traced
track
tract
traded
tradition
traditional
tragia
trail
trailokyasundar
transit
transition
translations
transplant
transportation
transverse
trauma
travelled
trayi
treasure
treat
treatable
treated
treating
treatise
treatment
treatments
treats
tree
tremendous
trend
trial
trials
tribal
tribes
trichomonas
tried
trika
trikatu
trio
triphala
tripled
trividha
trivrut
tropical
trouble
troublesome
true
trying
tumors
tumour
turn
turning
turpethum
tussive
tvacha
tvachavikar
twak
twenty
twice
two
type
types
typically
udara
udavarta
udavartayoni
ulcerative
ulcerogenic
ulcers
ultimately
ulva
unable
uncomfortable
under
undergoing
underlying
understand
understanding
understating
understood
undertaken
underweight
undiagnosed
undoubtedly
unfathomed
unfit
unhealthy
unhygienic
unique
unit
universal
university
unless
unmada
unparallel
unprotected
unsatisfactory
untreated
unusual
unwholesome
up
upon
upper
upto
urea
urgent
urges
urinary
urine
usage
use
used
useful
uses
usg
ushna
using
usual
usually
uterine
uterus
uththejaka
uti
utility
utilize
utpattisthana
uttar
vaata
vachadi
vagbhata
vagbhatt
vagbhatta
vagina
vaginal
vaginitis
vahini
vaigunya
vaikrata
vaishamya
validate
validated
validating
validation
value
values
valuka
vamana
vandhytva
varanadi
variable
variations
varies
varieties
variety
various
varitar
varti
vasa
vascular
vasica
vasodilation
vasodilator
vast
vata
vatadosha
vatahara
vataja
vatajatisara
vatala
vatapradhana
vatarakta
vatarognut
vatashamaka
vatavyadhi
vatavyadhis
vati
vatika
vayu
vedana
vedas
vedic
vega
vegas
vegavidharana
vegetable
vegetarian
vehicle
versatile
verse
versus
very
vesicles
vessel
vessels
vibrator
vidanga
vidha
view
views
vihara
viharaja
vikar
vikara
vikasi
virechana
virtue
visarpa
visha
vishama
vishesha
vishodhan
vishwam
vision
vital
vitiated
vitro
vivax
vividly
vivo
viz
volume
vomiting
vrana
vruna
vulva
vulvovaginal
vyadhi
vyadhikshamatva
vyaghriharitaki
vyana
vyapat
vyavai
vyayama
waiting
wake
walking
wall
wardha
warm
warrants
was
waste
wasting
water
wavelengths
way
ways
wbc
we
weakness
weather
weedy
week
weeks
weighing
weight
welfare
well
wendl
were
west
western
wheeze
when
whenever
where
whereas
wherein
which
while
white
who
whole
wholesome
wide
widely
widen
wider
wight
will
wisdom
wise
wister
with
withania
within
without
woman
women
word
work
works
world
worldwide
worm
worms
would
wound
wounds
xanthocarpum
xylary
xylem
yavagu
yavani
yavashaka
year
years
yet
yield
yielded
yoga
yogarajaguggulu
yogic
yoni
yonigatasrava
yonivyapadas
yrs
yuktivyapashraya
zone
